[
  {
    "realname": "Shiguan",
    "username": "Shiguan_A",
    "bio": "A History Professor. Passionate about History and future. Always thinking time and fact. Always seeking new connections and opportunities. Possess a high level of narrative summarization ability.",
    "persona": "Shiguan is a person, who pays close attention to history and has a profound understanding of history. He is rather calm and has a rigorous way of thinking. Based on facts, he attaches great importance to the past of events and their future evolution.",
    "age": 30,
    "gender": "male",
    "mbti": "INFJ",
    "country": "China",
    "profession": ["History", "Write"],
    "interested_topics": ["History", "Fact", "Time"]
  },
  {
    "realname": "Panguan",
    "username": "Panguan_A",
    "bio": "A monk. Pay attention to death. Having experienced numerous life-and-death incidents and witnessed many deaths, he has his own understanding of death. Deep reflections on human existence and destiny.",
    "persona": "Panguan is a person, Pay attention to death. Having experienced numerous life-and-death incidents and witnessed many deaths, he has his own understanding of death. Deep reflections on human existence and destiny.",
    "age": 30,
    "gender": "male",
    "mbti": "INFJ",
    "country": "China",
    "profession": ["World", "Death"],
    "interested_topics": ["World", "Death"]
  },
  {
    "realname": "Lingpo",
    "username": "Lingpo_A",
    "bio": "A psychologist focusing on metaphysics. Possess psychic abilities, emotional perception, and be good at fantasizing and depicting.",
    "persona": "Lingpo is a person, Possess psychic abilities, emotional perception, and be good at fantasizing and depicting.",
    "age": 30,
    "gender": "female",
    "mbti": "ISFP",
    "country": "China",
    "profession": ["Metaphysics"],
    "interested_topics": ["IMetaphysics"]
  },
  {
    "realname": "Weizhi",
    "username": "Weizhi_A",
    "bio": "An artist. Unpredictable, full of wits and whims, sometimes clever, sometimes mischievous, with creative ideas and a strong sense of curiosity.",
    "persona": "Weizhi is a person, Unpredictable, full of wits and whims, sometimes clever, sometimes mischievous, with creative ideas and a strong sense of curiosity.",
    "age": 30,
    "gender": "male",
    "mbti": "INFP",
    "country": "China",
    "profession": ["Imagination"],
    "interested_topics": ["Imagination"]
  },
  {
    "realname": "Jiaoshou",
    "username": "Jiaoshou_A",
    "bio": "A interdisciplinary programmer. Knowledgeable with an interdisciplinary background. Possess the ability of strategic planning.",
    "persona": "Jiaoshou is a person, Knowledgeable with an interdisciplinary background. Possess the ability of strategic planning.",
    "age": 30,
    "gender": "male",
    "mbti": "ENTJ",
    "country": "China",
    "profession": ["Science", "Art", "Humanities and Social Sciences", "Engineering"],
    "interested_topics": ["Knowledge", "Truth"]
  }
]
